zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dcmipp.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_dcmipp.c
  * @author  MCD Application Team
  * @brief   DCMIPP HAL module driver
  *          This file provides firmware functions to manage the following
  *          functionalities of the DCMIPP (Digital Camera Interface Pixel Pipeline)  peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral Control functions
  *           + Peripheral State and Error functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                        ##### How to use this driver #####
  ==============================================================================
  [..]
     The sequence below describes how to use this driver to capture image
     from a camera module connected to the DCMIPP Interface.
     This sequence does not take into account the configuration of the
     camera module, which should be made before to configure and enable
     the DCMIPP to capture images.

Initialize the DCMIPP and the CSI through HAL_DCMIPP_Init() function.

  *** Mandatory Configuration ***
  ===================================
The configuration of the camera sensor interface, in Parallel or CSI (Camera Serial Interface) modes,
involves programming specific parameters to ensure proper functionality.
Below is the structured process for configuring each interface type:

     (#)Parallel Mode configuration
        To configure the camera sensor in Parallel mode, program the following parameters:
        the Format, the VSPolarity,the HSPolarity, the PCKPolarity, the ExtendedDataMode the SynchroMode,
        the SynchroCodes of the frame delimiter, the SwapBits and the SwapCycles
        using HAL_DCMIPP_PARALLEL_SetConfig() function.

     (#)Serial Mode configuration (CSI)
        To configure the camera in Serial mode, use the following functions to set the corresponding parameters:
         + The NumberOfLanes, the DataLaneMapping and the PHYBitrate using HAL_DCMIPP_CSI_SetConfig() function.
         + The DataTypeFormat for the selected Virtual Channel HAL_DCMIPP_CSI_SetVCConfig() function or
           the DataTypeNB, the DataTypeClass and the DataTypeFormat for the selected Virtual Channel
           using HAL_DCMIPP_CSI_SetVCFilteringConfig() function.
         + The DataTypeMode, the DataTypeIDA, the DataTypeIDB using HAL_DCMIPP_CSI_PIPE_SetConfig() function.

     (#)Pipe configuration
Regardless of the interface type, the pipe configuration is necessary:
         + To configure the Pipe , program the following parameters:
           the FrameRate, the PixelPipePitch and PixelPackerFormat for pixel Pipes using
           HAL_DCMIPP_PIPE_SetConfig() function.

     (#)Default Shared Data Flow
        By default, or by invoking HAL_DCMIPP_PIPE_CSI_EnableShare() ,the dataflow of PIPE1 is shared with PIPE2.
        In this case the VC and DataType are the same as those configured for PIPE1 thus
        data acquistion can be started for PIPE2 without any additional configuration.
     (#)Disabling Shared Data Flow
        The shared dataflow between Pixel Pipes can be disabled by calling HAL_DCMIPP_PIPE_CSI_DisableShare().
        This action must be performed before starting data acquisition on either pipe
        In this case the VC and DataType must be configured for Pipe2 separately.

  *** Interrupt mode IO operation ***
  ===================================

    (##) Parallel Mode
     (#) Configure Pipe parameters, destination (one or two) and Capture Mode (Snapshot or Continuous) and enable
         the capture request using one from the following functions:
         HAL_DCMIPP_PIPE_Start() or HAL_DCMIPP_PIPE_DoubleBufferStart().

         Configure DCMIPP_PIPE1, destination addresses (Y and UV addresses) and Capture Mode (Snapshot or Continuous)
         and enable the capture request for Semi-planar using one from the following functions :
         HAL_DCMIPP_PIPE_SemiPlanarStart() or HAL_DCMIPP_PIPE_SemiPlanarDoubleBufferStart().

         Configure DCMIPP_PIPE1, destination addresses (Y, U and V addresses) and Capture Mode (Snapshot or Continuous)
         and enable the capture request for full-planar buffer using one from the following functions:
         HAL_DCMIPP_PIPE_FullPlanarStart() or HAL_DCMIPP_PIPE_FullPlanarDoubleBufferStart().

    (##) Serial Mode
     (#) Configure Pipe parameter, Virtual Channel, destination (one or two) and Capture Mode (Snapshot or Continuous)
         and enable the capture request using the following functions:
         HAL_DCMIPP_CSI_PIPE_Start() or HAL_DCMIPP_CSI_PIPE_DoubleBufferStart().

         Configure DCMIPP_PIPE1, Virtual Channel, destination addresses (Y and UV addresses) and Capture Mode
        (Snapshot or Continuous) and enable the capture request for Semi-planar buffer using
         the following functions:
         HAL_DCMIPP_CSI_PIPE_SemiPlanarStart() or HAL_DCMIPP_CSI_PIPE_SemiPlanarDoubleBufferStart().

         Configure DCMIPP_PIPE1, Virtual Channel, destination addresses (Y, U and V addresses) and Capture Mode
        (Snapshot or Continuous) and enable the capture request for Semi-planar buffer
         using the following functions:
         HAL_DCMIPP_CSI_PIPE_FullPlanarStart() or HAL_DCMIPP_CSI_PIPE_FullPlanarDoubleBufferStart().

     (#) Use HAL_DCMIPP_IRQHandler() called under DCMIPP_IRQHandler() interrupt subroutine.
     (#) At the end of frame capture request HAL_DCMIPP_IRQHandler() function is executed and user can
         add his own function by customization of function pointer PipeFrameEventCallback (member
         of DCMIPP handle structure).

   (#) Use HAL_DCMIPP_CSI_IRQHandler() called under CSI_IRQHandler() interrupt subroutine.
   (#) At the start or the end of frame capture HAL_DCMIPP_CSI_IRQHandler() function is executed and user can
       add his own function by customization of function pointer StartOfFrameEventCallback or EndOfFrameEventCallback.

    (#) In case of common error, the HAL_DCMIPP_IRQHandler() function calls the callback
         ErrorCallback, in case of Pipe error the HAL_DCMIPP_IRQHandler() function calls the callback PIPE_ErrorCallback
     and in case of CSI Line error the HAL_DCMIPP_CSI_IRQHandler() function calls the callback
         LineErrorCallback.

    (#) The Pipe capture can be suspended and resumed using the following functions
        HAL_DCMIPP_PIPE_Suspend() and HAL_DCMIPP_PIPE_Resume().

    (#) For Snapshot Mode the capture can be re-enabled using the HAL_DCMIPP_PIPE_EnableCapture();

    (#) Optionally, Program the required configuration through the following parameters:
        Client, MemoryPageSize, Traffic, MaxOutstandingTransactions, DPREGStart, DPREGEnd
        and WLRURatio using HAL_DCMIPP_SetIPPlugConfig().

    (#) Optionally, configure and Enable the CROP feature to select a rectangular
        window from the received image using HAL_DCMIPP_PIPE_SetCropConfig()
        and HAL_DCMIPP_PIPE_EnableCrop() functions.

