zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dcmipp.c
#if defined(DCMIPP_CSI2_SUPPORT)
    /* Set Parallel Input Selection */
    CLEAR_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_INSEL);
#endif /* DCMIPP_CSI2_SUPPORT */
  }

  /* Update the DCMIPP state */
  hdcmipp->State = HAL_DCMIPP_STATE_READY;

  return HAL_OK;
}

#if defined(DCMIPP_CSI2_SUPPORT)
/**
  * @brief  Configure the DCMIPP Serial Interface according to the user parameters.
  * @param  hdcmipp     Pointer to DCMIPP handle
  * @param  pCSI_Config pointer to DCMIPP_CSI_ConfTypeDef that contains the Serial Interface
  *                     configuration information for DCMIPP.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_SetConfig(DCMIPP_HandleTypeDef *hdcmipp,
                                           const DCMIPP_CSI_ConfTypeDef *pCSI_Config)
{
  CSI_TypeDef *csi_instance;
  csi_instance = CSI;

  const SNPS_FreqsTypeDef SNPS_Freqs[63] =
  {
    { 0x00U, 460U },  /* HAL_CSI_BT_80 */
    { 0x10U, 460U },  /* HAL_CSI_BT_90 */
    { 0x20U, 460U },  /* HAL_CSI_BT_100 */
    { 0x30U, 460U },  /* HAL_CSI_BT_110 */
    { 0x01U, 460U },  /* HAL_CSI_BT_120 */
    { 0x11U, 460U },  /* HAL_CSI_BT_130 */
    { 0x21U, 460U },  /* HAL_CSI_BT_140 */
    { 0x31U, 460U },  /* HAL_CSI_BT_150 */
    { 0x02U, 460U },  /* HAL_CSI_BT_160 */
    { 0x12U, 460U },  /* HAL_CSI_BT_170 */
    { 0x22U, 460U },  /* HAL_CSI_BT_180 */
    { 0x32U, 460U },  /* HAL_CSI_BT_190 */
    { 0x03U, 460U },  /* HAL_CSI_BT_205 */
    { 0x13U, 460U },  /* HAL_CSI_BT_220 */
    { 0x23U, 460U },  /* HAL_CSI_BT_235 */
    { 0x33U, 460U },  /* HAL_CSI_BT_250 */
    { 0x04U, 460U },  /* HAL_CSI_BT_275 */
    { 0x14U, 460U },  /* HAL_CSI_BT_300 */
    { 0x25U, 460U },  /* HAL_CSI_BT_325 */
    { 0x35U, 460U },  /* HAL_CSI_BT_350 */
    { 0x05U, 460U },  /* HAL_CSI_BT_400 */
    { 0x16U, 460U },  /* HAL_CSI_BT_450 */
    { 0x26U, 460U },  /* HAL_CSI_BT_500 */
    { 0x37U, 460U },  /* HAL_CSI_BT_550 */
    { 0x07U, 460U },  /* HAL_CSI_BT_600 */
    { 0x18U, 460U },  /* HAL_CSI_BT_650 */
    { 0x28U, 460U },  /* HAL_CSI_BT_700 */
    { 0x39U, 460U },  /* HAL_CSI_BT_750 */
    { 0x09U, 460U },  /* HAL_CSI_BT_800 */
    { 0x19U, 460U },  /* HAL_CSI_BT_850 */
    { 0x29U, 460U },  /* HAL_CSI_BT_900 */
    { 0x3AU, 460U },  /* HAL_CSI_BT_950 */
    { 0x0AU, 460U },  /* HAL_CSI_BT_1000 */
    { 0x1AU, 460U },  /* HAL_CSI_BT_1050 */
    { 0x2AU, 460U },  /* HAL_CSI_BT_1100 */
    { 0x3BU, 460U },  /* HAL_CSI_BT_1150 */
    { 0x0BU, 460U },  /* HAL_CSI_BT_1200 */
    { 0x1BU, 460U },  /* HAL_CSI_BT_1250 */
    { 0x2BU, 460U },  /* HAL_CSI_BT_1300 */
    { 0x3CU, 460U },  /* HAL_CSI_BT_1350 */
    { 0x0CU, 460U },  /* HAL_CSI_BT_1400 */
    { 0x1CU, 460U },  /* HAL_CSI_BT_1450 */
    { 0x2CU, 460U },  /* HAL_CSI_BT_1500 */
    { 0x3DU, 285U },  /* HAL_CSI_BT_1550 */
    { 0x0DU, 295U },  /* HAL_CSI_BT_1600 */
    { 0x1DU, 304U },  /* HAL_CSI_BT_1650 */
    { 0x2EU, 313U },  /* HAL_CSI_BT_1700 */
    { 0x3EU, 322U },  /* HAL_CSI_BT_1750 */
    { 0x0EU, 331U },  /* HAL_CSI_BT_1800 */
    { 0x1EU, 341U },  /* HAL_CSI_BT_1850 */
    { 0x2FU, 350U },  /* HAL_CSI_BT_1900 */
    { 0x3FU, 359U },  /* HAL_CSI_BT_1950 */
    { 0x0FU, 368U },  /* HAL_CSI_BT_2000 */
    { 0x40U, 377U },  /* HAL_CSI_BT_2050 */
    { 0x41U, 387U },  /* HAL_CSI_BT_2100 */
    { 0x42U, 396U },  /* HAL_CSI_BT_2150 */
    { 0x43U, 405U },  /* HAL_CSI_BT_2200 */
    { 0x44U, 414U },  /* HAL_CSI_BT_2250 */
    { 0x45U, 423U },  /* HAL_CSI_BT_2300 */
    { 0x46U, 432U },  /* HAL_CSI_BT_2350 */
    { 0x47U, 442U },  /* HAL_CSI_BT_2400 */
    { 0x48U, 451U },  /* HAL_CSI_BT_2450 */
    { 0x49U, 460U },  /* HAL_CSI_BT_2500 */
  };

  /* Check parameters */
  if ((hdcmipp == NULL) || (pCSI_Config == NULL))
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_DCMIPP_ALL_INSTANCE(hdcmipp->Instance));
  assert_param(IS_DCMIPP_NUMBER_OF_LANES(pCSI_Config->NumberOfLanes));
  assert_param(IS_DCMIPP_CSI_DATA_LANE_MAPPING(pCSI_Config->DataLaneMapping));
  assert_param(IS_DCMIPP_CSI_DATA_PHY_BITRATE(pCSI_Config->PHYBitrate));

  /* Ensure the CSI is disabled */
  CLEAR_BIT(csi_instance->CR, CSI_CR_CSIEN);

  /* Configure the Lane Merger */
  if (pCSI_Config->DataLaneMapping == DCMIPP_CSI_PHYSICAL_DATA_LANES)
  {
    WRITE_REG(csi_instance->LMCFGR, pCSI_Config->NumberOfLanes | (DCMIPP_CSI_DATA_LANE0 << CSI_LMCFGR_DL0MAP_Pos) | \
              (DCMIPP_CSI_DATA_LANE1 << CSI_LMCFGR_DL1MAP_Pos));
  }
  else if (pCSI_Config->DataLaneMapping == DCMIPP_CSI_INVERTED_DATA_LANES)
  {
    WRITE_REG(csi_instance->LMCFGR, pCSI_Config->NumberOfLanes | (DCMIPP_CSI_DATA_LANE1 << CSI_LMCFGR_DL0MAP_Pos) | \
              (DCMIPP_CSI_DATA_LANE0 << CSI_LMCFGR_DL1MAP_Pos));
  }
  else
  {
    return HAL_ERROR;
  }

  /* Enable the CSI */
  SET_BIT(csi_instance->CR, CSI_CR_CSIEN);

  /* Enable some interrupts, not related to virtual channels - all error cases */
  __HAL_DCMIPP_CSI_ENABLE_IT(csi_instance, DCMIPP_CSI_IT_CCFIFO |  DCMIPP_CSI_IT_SYNCERR | \
                             DCMIPP_CSI_IT_SPKTERR | DCMIPP_CSI_IT_IDERR | \
                             DCMIPP_CSI_IT_SPKT);

  /* Enable D-PHY Interrupts */
  if (pCSI_Config->NumberOfLanes == DCMIPP_CSI_ONE_DATA_LANE)
  {
    if (pCSI_Config->DataLaneMapping == DCMIPP_CSI_PHYSICAL_DATA_LANES)
    {
      __HAL_DCMIPP_CSI_DPHY_ENABLE_IT(csi_instance, DCMIPP_CSI_IT_ESOTDL0 | DCMIPP_CSI_IT_ESOTSYNCDL0 |
                                      DCMIPP_CSI_IT_EESCDL0 | DCMIPP_CSI_IT_ESYNCESCDL0 |
                                      DCMIPP_CSI_IT_ECTRLDL0);
    }
    else
    {
      __HAL_DCMIPP_CSI_DPHY_ENABLE_IT(csi_instance, DCMIPP_CSI_IT_ESOTDL1 | DCMIPP_CSI_IT_ESOTSYNCDL1 |
                                      DCMIPP_CSI_IT_EESCDL1 | DCMIPP_CSI_IT_ESYNCESCDL1 |
                                      DCMIPP_CSI_IT_ECTRLDL1);
    }
  }
  else
  {
    __HAL_DCMIPP_CSI_DPHY_ENABLE_IT(csi_instance, DCMIPP_CSI_IT_ESOTDL1 | DCMIPP_CSI_IT_ESOTSYNCDL1 |
                                    DCMIPP_CSI_IT_EESCDL1 | DCMIPP_CSI_IT_ESYNCESCDL1 |
                                    DCMIPP_CSI_IT_ECTRLDL1 |
                                    DCMIPP_CSI_IT_ESOTDL0 | DCMIPP_CSI_IT_ESOTSYNCDL0 |
                                    DCMIPP_CSI_IT_EESCDL0 | DCMIPP_CSI_IT_ESYNCESCDL0 |
                                    DCMIPP_CSI_IT_ECTRLDL0);
  }

