zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dcmipp.c
  /* IP-Plug is currently locked and can be reconfigured */

  /* Set Memory page size */
  hdcmipp->Instance->IPGR1 = (pIPPlugConfig->MemoryPageSize);

  /* IP-PLUG Client1 configuration */
  switch (pIPPlugConfig->Client)
  {
    case DCMIPP_CLIENT1:
    {
      /* Set Traffic : Burst size and maximum Outstanding transactions */
      hdcmipp->Instance->IPC1R1 = (pIPPlugConfig->Traffic |
                                   (pIPPlugConfig->MaxOutstandingTransactions << DCMIPP_IPC1R1_OTR_Pos));

      /* Set Ratio arbitration */
      hdcmipp->Instance->IPC1R2 = (pIPPlugConfig->WLRURatio << DCMIPP_IPC1R2_WLRU_Pos);

      /* Set End word and Start Word of the FIFO of the Clientx */
      hdcmipp->Instance->IPC1R3 = ((pIPPlugConfig->DPREGStart << DCMIPP_IPC1R3_DPREGSTART_Pos) |
                                   (pIPPlugConfig->DPREGEnd << DCMIPP_IPC1R3_DPREGEND_Pos));
      break;
    }
    case DCMIPP_CLIENT2:
    {
      /* Set Traffic : Burst size and maximum Outstanding transactions */
      hdcmipp->Instance->IPC2R1 = (pIPPlugConfig->Traffic |
                                   (pIPPlugConfig->MaxOutstandingTransactions << DCMIPP_IPC2R1_OTR_Pos));

      /* Set Ratio arbitration */
      hdcmipp->Instance->IPC2R2 = (pIPPlugConfig->WLRURatio << DCMIPP_IPC2R2_WLRU_Pos);

      /* Set End word and Start Word of the FIFO of the Clientx */
      hdcmipp->Instance->IPC2R3 = ((pIPPlugConfig->DPREGStart << DCMIPP_IPC2R3_DPREGSTART_Pos) |
                                   (pIPPlugConfig->DPREGEnd << DCMIPP_IPC2R3_DPREGEND_Pos));
      break;
    }
    case DCMIPP_CLIENT3:
    {
      /* Set Traffic : Burst size and Maximum Outstanding transactions */
      hdcmipp->Instance->IPC3R1 = (pIPPlugConfig->Traffic |
                                   (pIPPlugConfig->MaxOutstandingTransactions << DCMIPP_IPC3R1_OTR_Pos));

      /* Set Ratio arbitration */
      hdcmipp->Instance->IPC3R2 = (pIPPlugConfig->WLRURatio << DCMIPP_IPC3R2_WLRU_Pos);

      /* Set End word and Start Word of the FIFO of the Clientx */
      hdcmipp->Instance->IPC3R3 = ((pIPPlugConfig->DPREGStart << DCMIPP_IPC3R3_DPREGSTART_Pos) |
                                   (pIPPlugConfig->DPREGEnd << DCMIPP_IPC3R3_DPREGEND_Pos));
      break;
    }
    case DCMIPP_CLIENT4:
    {
      /* Set Traffic : Burst size and Maximum Outstanding transactions */
      hdcmipp->Instance->IPC4R1 = (pIPPlugConfig->Traffic |
                                   (pIPPlugConfig->MaxOutstandingTransactions << DCMIPP_IPC4R1_OTR_Pos));

      /* Set Ratio arbitration */
      hdcmipp->Instance->IPC4R2 = (pIPPlugConfig->WLRURatio << DCMIPP_IPC4R2_WLRU_Pos);

      /* Set End word and Start Word of the FIFO of the Clientx */
      hdcmipp->Instance->IPC4R3 = ((pIPPlugConfig->DPREGStart << DCMIPP_IPC4R3_DPREGSTART_Pos) |
                                   (pIPPlugConfig->DPREGEnd << DCMIPP_IPC4R3_DPREGEND_Pos));
      break;
    }
    case DCMIPP_CLIENT5:
    {
      /* Set Traffic : Burst size and Maximum Outstanding transactions */
      hdcmipp->Instance->IPC5R1 = (pIPPlugConfig->Traffic |
                                   (pIPPlugConfig->MaxOutstandingTransactions << DCMIPP_IPC5R1_OTR_Pos));

      /* Set Ratio arbitration */
      hdcmipp->Instance->IPC5R2 = (pIPPlugConfig->WLRURatio << DCMIPP_IPC5R2_WLRU_Pos);

      /* Set End word and Start Word of the FIFO of the Clientx */
      hdcmipp->Instance->IPC5R3 = ((pIPPlugConfig->DPREGStart << DCMIPP_IPC5R3_DPREGSTART_Pos) |
                                   (pIPPlugConfig->DPREGEnd << DCMIPP_IPC5R3_DPREGEND_Pos));
      break;
    }
#if defined(DCMIPP_P1HISTOGRAM_SUPPORT)
    case DCMIPP_CLIENT6:
    {
      /* Set Traffic : Burst size and Maximum Outstanding transactions */
      hdcmipp->Instance->IPC6R1 = (pIPPlugConfig->Traffic |
                                   (pIPPlugConfig->MaxOutstandingTransactions << DCMIPP_IPC6R1_OTR_Pos));

      /* Set Ratio arbitration */
      hdcmipp->Instance->IPC6R2 = (pIPPlugConfig->WLRURatio << DCMIPP_IPC6R2_WLRU_Pos);

      /* Set End word and Start Word of the FIFO of the Clientx */
      hdcmipp->Instance->IPC6R3 = ((pIPPlugConfig->DPREGStart << DCMIPP_IPC6R3_DPREGSTART_Pos) |
                                   (pIPPlugConfig->DPREGEnd << DCMIPP_IPC6R3_DPREGEND_Pos));
      break;
    }
#endif /* DCMIPP_P1HISTOGRAM_SUPPORT */
    default:
      break;
  }

  /* No lock requested, IP-Plug runs on demand by background HW */
  CLEAR_BIT(hdcmipp->Instance->IPGR2, DCMIPP_IPGR2_PSTART);

  /* Enable DCMIPP_IT_AXI_TRANSFER_ERR */
  __HAL_DCMIPP_ENABLE_IT(hdcmipp, DCMIPP_IT_AXI_TRANSFER_ERROR);

  return HAL_OK;
}

/**
  * @}
  */
/** @defgroup DCMIPP_TPG_Configuration_Functions DCMIPP TPG Configuration Functions
  * @brief    TPG Configuration Functions
@verbatim
===============================================================================
            ##### TPG Configuration Functions #####
 ===============================================================================
    [..]  This subsection provides a set of functions allowing to control the Test
          pattern generator.
@endverbatim
  * @{
  */

/**
  * @brief  Configure TPG
  * @param  hdcmipp Pointer to DCMIPP handle
  * @param  pTPGConfig  pointer to TPG configuration structure
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_DCMIPP_TPG_SetConfig(DCMIPP_HandleTypeDef *hdcmipp, const DCMIPP_TPGConfTypeDef *pTPGConfig)
{
  HAL_DCMIPP_StateTypeDef tmp;

  assert_param(IS_DCMIPP_TPG_WIDTH(pTPGConfig->Width));
  assert_param(IS_DCMIPP_TPG_HEIGHT(pTPGConfig->Height));
  assert_param(IS_DCMIPP_TPG_VBL(pTPGConfig->VBL));
  assert_param(IS_DCMIPP_TPG_FORMAT(pTPGConfig->Format));
  assert_param(IS_DCMIPP_TPG_PATTERN(pTPGConfig->Pattern));
  assert_param(IS_DCMIPP_TPG_GREY_SCALE(pTPGConfig->GreyScale));
  assert_param(IS_DCMIPP_TPG_LIFELINE(pTPGConfig->Lifeline));

  if ((hdcmipp == NULL) || (pTPGConfig == NULL))
  {
    return HAL_ERROR;
  }

  tmp = hdcmipp->State;

  if ((tmp == HAL_DCMIPP_STATE_INIT) || (tmp == HAL_DCMIPP_STATE_READY))
  {
    if (READ_FIELD(hdcmipp->Instance->CMTPGCR2, DCMIPP_CMTPGCR2_TPGEN) == 0U)
    {
      /* Set the width and height */
      WRITE_REG(hdcmipp->Instance->CMTPGCR1, (pTPGConfig->Height << DCMIPP_CMTPGCR1_HEIGHT_Pos) | \
                (pTPGConfig->Width << DCMIPP_CMTPGCR1_WIDTH_Pos));

