zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dcmipp.c
      WRITE_REG(hdcmipp->Instance->CMTPGCR2, (pTPGConfig->VBL << DCMIPP_CMTPGCR2_VBL_Pos) | \
                pTPGConfig->Format |       \
                pTPGConfig->Pattern |      \
                pTPGConfig->GreyScale |    \
                pTPGConfig->Lifeline);

      if ((pTPGConfig->Format == DCMIPP_TPG_FORMAT_RAW8) || (pTPGConfig->Format == DCMIPP_TPG_FORMAT_RAW10) ||
          (pTPGConfig->Format == DCMIPP_TPG_FORMAT_RAW12) || (pTPGConfig->Format == DCMIPP_TPG_FORMAT_RAW14))
      {
        assert_param(IS_DCMIPP_TPG_RAW_TYPE(pTPGConfig->RawBayerType));
        hdcmipp->Instance->CMTPGCR2 |= pTPGConfig->RawBayerType;
      }
      else if (pTPGConfig->Format == DCMIPP_TPG_FORMAT_YUV422)
      {
        assert_param(IS_DCMIPP_TPG_YUV_TYPE(pTPGConfig->YUVType));
        hdcmipp->Instance->CMTPGCR2 |= pTPGConfig->YUVType;
      }
      else
      {
        /* Do Nothing */
      }

      /* Update the DCMIPP state */
      hdcmipp->State = HAL_DCMIPP_STATE_READY;
    }
    else
    {
      return HAL_ERROR;
    }
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Enable TPG
  * @param  hdcmipp Pointer to DCMIPP handle
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_DCMIPP_TPG_Enable(DCMIPP_HandleTypeDef *hdcmipp)
{
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  SET_BIT(hdcmipp->Instance->CMTPGCR2, DCMIPP_CMTPGCR2_TPGEN);

  return HAL_OK;
}

/**
  * @brief  Disable TPG
  * @param  hdcmipp Pointer to DCMIPP handle
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_DCMIPP_TPG_Disable(DCMIPP_HandleTypeDef *hdcmipp)
{
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  CLEAR_BIT(hdcmipp->Instance->CMTPGCR2, DCMIPP_CMTPGCR2_TPGEN);

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup DCMIPP_IO_operation_Functions DCMIPP IO operation Functions
  *  @brief     IO operation functions
  * @{
  */
/**
  * @brief  Start the DCMIPP capture on the specified pipe
  * @param  hdcmipp     Pointer to DCMIPP handle
  * @param  Pipe        Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  DstAddress  the destination address
  * @param  CaptureMode DCMIPP capture mode for the pipe can be a value from @ref DCMIPP_Capture_Mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_Start(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe, uint32_t DstAddress,
                                        uint32_t CaptureMode)
{
  uint32_t mode;
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_CAPTURE_MODE(CaptureMode));

  /* Check pointer validity */
  if ((hdcmipp == NULL) || ((DstAddress & 0xFU) != 0U))
  {
    return HAL_ERROR;
  }

  /* Check DCMIPP pipe state */
#if defined(DCMIPP_CSI2_SUPPORT)
  mode = READ_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_INSEL);
  if ((hdcmipp->PipeState[Pipe] != HAL_DCMIPP_PIPE_STATE_READY) || (mode != DCMIPP_PARALLEL_MODE))
#else
  UNUSED(mode);
  if (hdcmipp->PipeState[Pipe]  != HAL_DCMIPP_PIPE_STATE_READY)
#endif /* DCMIPP_CSI2_SUPPORT */
  {
    return HAL_ERROR;
  }

  /* Set Capture Mode and Destination address for the selected pipe */
  DCMIPP_SetConfig(hdcmipp, Pipe, DstAddress, CaptureMode);

  /* Enable Capture for the selected Pipe */
  DCMIPP_EnableCapture(hdcmipp, Pipe);

  return HAL_OK;
}

/**
  * @brief  Stop DCMIPP capture on the specified pipe
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_Stop(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  HAL_DCMIPP_PipeStateTypeDef pipe_state;

  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Check pointer validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

#if defined(DCMIPP_CSI2_SUPPORT)
  if ((hdcmipp->Instance->CMCR & DCMIPP_CMCR_INSEL) != DCMIPP_PARALLEL_MODE)
  {
    return HAL_ERROR;
  }
#endif /* DCMIPP_CSI2_SUPPORT */
  /* Get Pipe State */
  pipe_state = hdcmipp->PipeState[Pipe];

  /* Check DCMIPP Pipe state */
  if (pipe_state != HAL_DCMIPP_PIPE_STATE_RESET)
  {
    if (DCMIPP_Stop(hdcmipp, Pipe) != HAL_OK)
    {
      return HAL_ERROR;
    }

    /* Update the DCMIPP pipe State */
    hdcmipp->PipeState[Pipe] = HAL_DCMIPP_PIPE_STATE_READY;
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Start the DCMIPP capture on the specified pipe for semi-planar
  * @param  hdcmipp               Pointer to DCMIPP handle
  * @param  Pipe                  Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pSemiPlanarDstAddress Pointer to the destination addresses
  * @param  CaptureMode DCMIPP capture mode for the pipe can be a value from @ref DCMIPP_Capture_Mode.
  * @note   Only DCMIPP_PIPE1 allows semi-planar buffer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SemiPlanarStart(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                  DCMIPP_SemiPlanarDstAddressTypeDef *pSemiPlanarDstAddress,
                                                  uint32_t CaptureMode)
{
  uint32_t mode;
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_CAPTURE_MODE(CaptureMode));

  /* Check pointer validity */
  if ((hdcmipp == NULL) || ((pSemiPlanarDstAddress->UVAddress & 0xFU) != 0U) || \
      ((pSemiPlanarDstAddress->YAddress & 0xFU) != 0U))
  {
    return HAL_ERROR;
  }

  if (Pipe == DCMIPP_PIPE1)
  {
    /* Check DCMIPP pipe state */
#if defined(DCMIPP_CSI2_SUPPORT)
    mode = READ_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_INSEL);
    if ((hdcmipp->PipeState[Pipe] != HAL_DCMIPP_PIPE_STATE_READY) || (mode != DCMIPP_PARALLEL_MODE))
#else
    UNUSED(mode);
    if (hdcmipp->PipeState[Pipe]  != HAL_DCMIPP_PIPE_STATE_READY)
#endif /* DCMIPP_CSI2_SUPPORT */
    {
      return HAL_ERROR;
    }
    /* Set Capture Mode and Destination address for the selected pipe */
    DCMIPP_SetConfig(hdcmipp, Pipe, pSemiPlanarDstAddress->YAddress, CaptureMode);

    /* Set Auxiliary Destination addresses */
    /* Set the destination address */
    WRITE_REG(hdcmipp->Instance->P1PPM1AR1, pSemiPlanarDstAddress->UVAddress);

    /* Enable Capture for the selected Pipe */
    DCMIPP_EnableCapture(hdcmipp, Pipe);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Start the DCMIPP capture on the specified pipe for semi-planar
  * @param  hdcmipp               Pointer to DCMIPP handle
  * @param  Pipe                  Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pFullPlanarDstAddress Pointer to the destination addresses
  * @param  CaptureMode DCMIPP capture mode for the pipe can be a value from @ref DCMIPP_Capture_Mode.
  * @note   Only DCMIPP_PIPE1 allows Full-planar buffer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_FullPlanarStart(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                  DCMIPP_FullPlanarDstAddressTypeDef *pFullPlanarDstAddress,
                                                  uint32_t CaptureMode)
{
  uint32_t mode;
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_CAPTURE_MODE(CaptureMode));

  /* Check pointer validity */
  if ((hdcmipp == NULL) || ((pFullPlanarDstAddress->YAddress & 0xFU) != 0U) ||
      ((pFullPlanarDstAddress->UAddress & 0xFU) != 0U) ||
      ((pFullPlanarDstAddress->VAddress & 0xFU) != 0U))
  {
    return HAL_ERROR;
  }

  if (Pipe == DCMIPP_PIPE1)
  {
    /* Check DCMIPP pipe state */
#if defined(DCMIPP_CSI2_SUPPORT)
    mode = READ_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_INSEL);
    if ((hdcmipp->PipeState[Pipe] != HAL_DCMIPP_PIPE_STATE_READY) || (mode != DCMIPP_PARALLEL_MODE))
#else
    UNUSED(mode);
    if (hdcmipp->PipeState[Pipe]  != HAL_DCMIPP_PIPE_STATE_READY)
#endif /* DCMIPP_CSI2_SUPPORT */
    {
      return HAL_ERROR;
    }

