zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dcmipp.c
    WRITE_REG(hdcmipp->Instance->P1CTCR2, (((uint32_t)pContrastConfig->LUM_32 << DCMIPP_P1CTCR2_LUM1_Pos) |
                                           ((uint32_t)pContrastConfig->LUM_64 << DCMIPP_P1CTCR2_LUM2_Pos) |
                                           ((uint32_t)pContrastConfig->LUM_96 << DCMIPP_P1CTCR2_LUM3_Pos) |
                                           ((uint32_t)pContrastConfig->LUM_128 << DCMIPP_P1CTCR2_LUM4_Pos)));

    WRITE_REG(hdcmipp->Instance->P1CTCR3, (((uint32_t)pContrastConfig->LUM_160 << DCMIPP_P1CTCR3_LUM5_Pos) |
                                           ((uint32_t)pContrastConfig->LUM_192 << DCMIPP_P1CTCR3_LUM6_Pos) |
                                           ((uint32_t)pContrastConfig->LUM_224 << DCMIPP_P1CTCR3_LUM7_Pos) |
                                           ((uint32_t)pContrastConfig->LUM_256 << DCMIPP_P1CTCR3_LUM8_Pos)));
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Enable the ISP Contrast for the selected DCMIPP Pipe
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_EnableISPCtrlContrast(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  /* Check handle validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    SET_BIT(hdcmipp->Instance->P1CTCR1, DCMIPP_P1CTCR1_ENABLE);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Disable the ISP Contrast for the selected DCMIPP Pipe
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_DisableISPCtrlContrast(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  /* Check handle validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    CLEAR_BIT(hdcmipp->Instance->P1CTCR1, DCMIPP_P1CTCR1_ENABLE);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @}
  */
/** @defgroup DCMIPP_PeripheralControl_Functions DCMIPP Peripheral Control Functions
@verbatim
===============================================================================
            ##### Peripheral Control Functions #####
 ===============================================================================
    [..]  This subsection provides a set of functions allowing
      (+) HAL_DCMIPP_PIPE_SetFrameRate                     : Set the frame rate.
      (+) HAL_DCMIPP_PIPE_SetCaptureMode                   : Set the capture mode.
      (+) HAL_DCMIPP_PIPE_EnableCapture                    : Enable the capture.
      (+) HAL_DCMIPP_PIPE_SetMemoryAddress                 : Set the destination memory address.
      (+) HAL_DCMIPP_PIPE_PARALLEL_SetInputPixelFormat     : Set input format in parallel mode.
      (+) HAL_DCMIPP_PIPE_SetPitch                         : Set the pitch.
      (+) HAL_DCMIPP_PIPE_SetPixelPackerFormat             : Set Pixel Packer format.
      (+) HAL_DCMIPP_PIPE_CSI_EnableShare                  : Enable sharing between pipes.
      (+) HAL_DCMIPP_PIPE_CSI_DisableShare                 : Disable share.
      (+) HAL_DCMIPP_PIPE_CSI_ForceDataTypeFormat          : Force data type format on CSI.
      (+) HAL_DCMIPP_PIPE_CSI_SetDTMode                    : Set data type mode.
      (+) HAL_DCMIPP_PIPE_CSI_SetDTSelection               : Set data type selection.
      (+) HAL_DCMIPP_PIPE_CSI_EnableHeader                 : Enable Header in CSI.
      (+) HAL_DCMIPP_PIPE_CSI_DisableHeader                : Disable Header in CSI.
      (+)  HAL_DCMIPP_PIPE_CSI_SetVirtualChannelID         : Set virtual channel id.
      (+) HAL_DCMIPP_PARALLEL_SetSyncUnmask                : Set Sync Unmask in Parallel interface.
      (+) HAL_DCMIPP_CSI_SetLineByteCounterConfig          : Set line byte counter Config in CSI.
        (+) HAL_DCMIPP_CSI_EnableLineByteCounter             : Enable line byte counter.
        (+) HAL_DCMIPP_CSI_DisableLineByteCounter            : Disable line byte counter.
      (+) HAL_DCMIPP_CSI_SetTimerConfig                    : Set Timer Config.
        (+) HAL_DCMIPP_CSI_EnableTimer                       : Enable Timer.
        (+) HAL_DCMIPP_CSI_DisableTimer                      : Disable timer
      (+) HAL_DCMIPP_CSI_SetWatchdogCounterConfig          : Set Watch dog counter Config.
      (+) HAL_DCMIPP_PIPE_EnablePAD                        : Enable Padding
      (+) HAL_DCMIPP_PIPE_DisablePAD                       : Disable Padding
      (+) HAL_DCMIPP_PIPE_PARALLEL_EnableComponentsSwap    : Enable component Swap in Parallel Interface
      (+) HAL_DCMIPP_PIPE_PARALLEL_DisableComponentsSwap   : Disable component Swap in Parallel Interface
      (+) HAL_DCMIPP_PIPE_DisableRedBlueSwap               : Disable RED BLUE swap
      (+) HAL_DCMIPP_PIPE_EnableRedBlueSwap                : Enable RED BLUE swap
      (+) HAL_DCMIPP_PIPE_DisableYUVSwap                   : Disable YUV swap
      (+) HAL_DCMIPP_PIPE_EnableYUVSwap                    : Enable YUV swap
@endverbatim
  * @{
  */
/**
  * @brief  Reconfigure the Frame Rate for the selected pipe
  * @param  hdcmipp    Pointer to DCMIPP handle
  * @param  Pipe       Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  FrameRate  the new Frame Rate, can be a value from @ref DCMIPP_Frame_Rates
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SetFrameRate(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe, uint32_t FrameRate)
{
  /* Check Parameters */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_FRAME_RATE(FrameRate));

  /* Set Frame Rate for the Pipe */
  if (Pipe == DCMIPP_PIPE0)
  {
    MODIFY_REG(hdcmipp->Instance->P0FCTCR, DCMIPP_P0FCTCR_FRATE, FrameRate);
  }
  else if (Pipe == DCMIPP_PIPE1)
  {
    MODIFY_REG(hdcmipp->Instance->P1FCTCR, DCMIPP_P1FCTCR_FRATE, FrameRate);
  }
  else if (Pipe == DCMIPP_PIPE2)
  {
    MODIFY_REG(hdcmipp->Instance->P2FCTCR, DCMIPP_P2FCTCR_FRATE, FrameRate);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Reconfigure the Pitch for the selected pipe
  * @param  hdcmipp    Pointer to DCMIPP handle
  * @param  Pipe       Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  LinePitch  the new Pitch value.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SetPitch(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe, uint32_t LinePitch)
{
  /* Check Parameters */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_PIXEL_PIPE_PITCH(LinePitch));

  /* Set Pixel Pipe Pitch for the Pipe */
  if (Pipe == DCMIPP_PIPE1)
  {
    MODIFY_REG(hdcmipp->Instance->P1PPM0PR, DCMIPP_P1PPM0PR_PITCH, LinePitch << DCMIPP_P1PPM0PR_PITCH_Pos);
  }
  else if (Pipe == DCMIPP_PIPE2)
  {
    MODIFY_REG(hdcmipp->Instance->P2PPM0PR, DCMIPP_P2PPM0PR_PITCH, LinePitch << DCMIPP_P2PPM0PR_PITCH_Pos);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Reconfigure the PixelPackerFormat for the selected pipe
  * @param  hdcmipp           Pointer to DCMIPP handle
  * @param  Pipe              Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  PixelPackerFormat the new Pixel Packer Format value.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SetPixelPackerFormat(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                       uint32_t PixelPackerFormat)
{
  /* Check Parameters */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_PIXEL_PACKER_FORMAT(PixelPackerFormat));

  /* Set Pixel Pipe Pitch for the Pipe */
  if (Pipe == DCMIPP_PIPE1)
  {
    /* Configure the pixel packer */
    MODIFY_REG(hdcmipp->Instance->P1PPCR, DCMIPP_P1PPCR_FORMAT, PixelPackerFormat);
  }
  else if (Pipe == DCMIPP_PIPE2)
  {
    MODIFY_REG(hdcmipp->Instance->P2PPCR, DCMIPP_P2PPCR_FORMAT, PixelPackerFormat);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Reconfigure Capture Mode for the selected pipe
  * @param  hdcmipp      Pointer to DCMIPP handle
  * @param  Pipe         Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  CaptureMode  the new Capture Mode, can be a value from @ref DCMIPP_Capture_Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SetCaptureMode(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe, uint32_t CaptureMode)
{
  /* Check Parameters */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_CAPTURE_MODE(CaptureMode));


