zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dcmipp.c
  /* Verify DCMIPP State */
  if (hdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    if (Pipe == DCMIPP_PIPE1)
    {
      SET_BIT(hdcmipp->Instance->P1PPCR, DCMIPP_P1PPCR_SWAPRB);
    }
    else if (Pipe == DCMIPP_PIPE2)
    {
      SET_BIT(hdcmipp->Instance->P2PPCR, DCMIPP_P2PPCR_SWAPRB);
    }
    else
    {
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}
/**
  * @brief  Disable the swapping of red and blue color components for the specified DCMIPP pipe.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_DisableRedBlueSwap(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Verify DCMIPP State */
  if (hdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    if (Pipe == DCMIPP_PIPE1)
    {
      CLEAR_BIT(hdcmipp->Instance->P1PPCR, DCMIPP_P1PPCR_SWAPRB);
    }
    else if (Pipe == DCMIPP_PIPE2)
    {
      CLEAR_BIT(hdcmipp->Instance->P2PPCR, DCMIPP_P2PPCR_SWAPRB);
    }
    else
    {
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}
/**
  * @brief  Enable the swapping of YUV color components for the specified DCMIPP pipe.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_EnableYUVSwap(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Verify DCMIPP State */
  if (hdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    if (Pipe == DCMIPP_PIPE0)
    {
      SET_BIT(hdcmipp->Instance->P0PPCR, DCMIPP_P0PPCR_SWAPYUV);
    }
    else
    {
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}
/**
  * @brief  Disable the swapping of YUV color components for the specified DCMIPP pipe.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_DisableYUVSwap(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Verify DCMIPP State */
  if (hdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    if (Pipe == DCMIPP_PIPE0)
    {
      CLEAR_BIT(hdcmipp->Instance->P0PPCR, DCMIPP_P0PPCR_SWAPYUV);
    }
    else
    {
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}

#if defined(DCMIPP_P1HISTOGRAM_SUPPORT)

/** @addtogroup DCMIPP_Histogram_Functions DCMIPP Histogram Functions
  * @brief      Histogram Functions
@verbatim
===============================================================================
            ##### DCMIPP Histogram Functions #####
 ===============================================================================
    [..]  This subsection provides a set of functions allowing
      (+) HAL_DCMIPP_PIPE_SetISPHistoConfig                : Configures Histogram.
      (+) HAL_DCMIPP_PIPE_SetISPHistoRegionConfig          : Configure Histogram Regions.
      (+) HAL_DCMIPP_PIPE_EnableHistogram                  : Enable Histogram.
      (+) HAL_DCMIPP_PIPE_DisableHistogram                 : Disable Histogram.
      (+) HAL_DCMIPP_PIPE_GetISPHistoConfig                : Get Histogram Config.
      (+) HAL_DCMIPP_PIPE_GetISPHistoRegionConfig          : Get Histogram Region Config.
      (+) HAL_DCMIPP_PIPE_GetISPHistoLastAddress           : Get Last Histogram address.
@endverbatim
  * @{
  */

/**
  * @brief  Configure Histogram for the specified DCMIPP pipe.
  * @param  hdcmipp       Pointer to DCMIPP handle
  * @param  Pipe          Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pHistoConfig  Pointer to Histogram Config
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SetISPHistoConfig(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                    const DCMIPP_Histogram_ConfTypeDef *pHistoConfig)
{
  if ((hdcmipp == NULL) || (pHistoConfig == NULL))
  {
    return HAL_ERROR;
  }

  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_HISTO_BINS(pHistoConfig->Bin));
  assert_param(IS_DCMIPP_HISTO_COMP(pHistoConfig->Components));
  assert_param(IS_DCMIPP_HISTO_PXL_DYN(pHistoConfig->PixelDynamic));
  assert_param(IS_DCMIPP_HISTO_SRC(pHistoConfig->Source));

  if (Pipe == DCMIPP_PIPE1)
  {
    MODIFY_REG(hdcmipp->Instance->P1HSCR, \
               (DCMIPP_P1HSCR_BIN | DCMIPP_P1HSCR_DYN | DCMIPP_P1HSCR_COMP | DCMIPP_P1HSCR_SRC), \
               (pHistoConfig->Bin << DCMIPP_P1HSCR_BIN_Pos) | \
               (pHistoConfig->PixelDynamic << DCMIPP_P1HSCR_DYN_Pos) | \
               (pHistoConfig->Components << DCMIPP_P1HSCR_COMP_Pos) | \
               (pHistoConfig->Source << DCMIPP_P1HSCR_SRC_Pos));
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Configure Histogram Regions for the specified DCMIPP pipe.
  * @param  hdcmipp          Pointer to DCMIPP handle
  * @param  Pipe             Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pHistoRegConfig  Pointer to Histogram Region Config
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SetISPHistoRegionConfig(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                          const DCMIPP_Histogram_RegionConfTypeDef *pHistoRegConfig)
{
  if ((hdcmipp == NULL) || (pHistoRegConfig == NULL))
  {
    return HAL_ERROR;
  }

  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_HISTO_HDEC(pHistoRegConfig->HDec));
  assert_param(IS_DCMIPP_HISTO_VDEC(pHistoRegConfig->VDec));
  assert_param(IS_DCMIPP_HISTO_VREG(pHistoRegConfig->VReg));
  assert_param(IS_DCMIPP_HISTO_HREG(pHistoRegConfig->HReg));
  assert_param(IS_DCMIPP_HISTO_VSTART(pHistoRegConfig->VStart));
  assert_param(IS_DCMIPP_HISTO_HSTART(pHistoRegConfig->HStart));
  assert_param(IS_DCMIPP_HISTO_VSIZE(pHistoRegConfig->VSize));
  assert_param(IS_DCMIPP_HISTO_HSIZE(pHistoRegConfig->HSize));

  if (((pHistoRegConfig->MemoryAddress) & 0xFU) != 0U)
  {
    return HAL_ERROR;
  }

  if (Pipe == DCMIPP_PIPE1)
  {
    MODIFY_REG(hdcmipp->Instance->P1HSCR, \
               (DCMIPP_P1HSCR_VDEC | DCMIPP_P1HSCR_HDEC | DCMIPP_P1HSCR_HREG | DCMIPP_P1HSCR_VREG), \
               ((uint32_t)pHistoRegConfig->VDec << DCMIPP_P1HSCR_VDEC_Pos) | \
               ((uint32_t)pHistoRegConfig->HDec << DCMIPP_P1HSCR_HDEC_Pos) | \
               ((uint32_t)pHistoRegConfig->VReg << DCMIPP_P1HSCR_VREG_Pos) | \
               ((uint32_t)pHistoRegConfig->HReg << DCMIPP_P1HSCR_HREG_Pos));

    WRITE_REG(hdcmipp->Instance->P1HSSTR, ((uint32_t)pHistoRegConfig->VStart << DCMIPP_P1HSSTR_VSTART_Pos) | \
              ((uint32_t)pHistoRegConfig->HStart << DCMIPP_P1HSSTR_HSTART_Pos));

    WRITE_REG(hdcmipp->Instance->P1HSSZR, ((uint32_t)pHistoRegConfig->VSize << DCMIPP_P1HSSZR_VSIZE_Pos) | \
              ((uint32_t)pHistoRegConfig->HSize << DCMIPP_P1HSSZR_HSIZE_Pos));

    WRITE_REG(hdcmipp->Instance->P1HSMAR1, pHistoRegConfig->MemoryAddress);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Enable Histogram for the specified DCMIPP pipe.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status.
  */
HAL_StatusTypeDef  HAL_DCMIPP_PIPE_EnableHistogram(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  if (Pipe == DCMIPP_PIPE1)
  {
    __HAL_DCMIPP_ENABLE_IT(hdcmipp, DCMIPP_IT_PIPE1_STATS | DCMIPP_IT_PIPE1_STATS_OVR | \
                           DCMIPP_IT_PIPE1_STATS_BAD_CFG);

    SET_BIT(hdcmipp->Instance->P1HSCR, DCMIPP_P1HSCR_EN);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Disable Histogram for the specified DCMIPP pipe.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status.
  */
HAL_StatusTypeDef  HAL_DCMIPP_PIPE_DisableHistogram(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  if (Pipe == DCMIPP_PIPE1)
  {
    CLEAR_BIT(hdcmipp->Instance->P1HSCR, DCMIPP_P1HSCR_EN);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Retrieve the Histogram configuration for a specified DCMIPP pipe.
  * @param  hdcmipp           Pointer to DCMIPP handle
  * @param  Pipe              Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pHistogramConfig  Pointer to a DCMIPP_Histogram_ConfTypeDef variable to receive the values.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPHistoConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                       DCMIPP_Histogram_ConfTypeDef *pHistogramConfig)
{
  uint32_t tmp;

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    tmp = READ_REG(hdcmipp->Instance->P1CHSCR);

