zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dcmipp.c
    pHistogramConfig->Components = ((tmp & DCMIPP_P1CHSCR_COMP) >> DCMIPP_P1CHSCR_COMP_Pos);
    pHistogramConfig->Source  = ((tmp & DCMIPP_P1CHSCR_SRC) >> DCMIPP_P1CHSCR_SRC_Pos);
    pHistogramConfig->Bin = ((tmp & DCMIPP_P1CHSCR_BIN) >> DCMIPP_P1CHSCR_BIN_Pos);
    pHistogramConfig->PixelDynamic  = ((tmp & DCMIPP_P1CHSCR_DYN) >> DCMIPP_P1CHSCR_DYN_Pos);
  }
}
/**
  * @brief  Retrieve the Histogram Region configuration for a specified DCMIPP pipe.
  * @param  hdcmipp           Pointer to DCMIPP handle
  * @param  Pipe              Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pHistogramConfig  Pointer to a DCMIPP_Histogram_RegionConfTypeDef variable to receive the values.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPHistoRegionConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                             DCMIPP_Histogram_RegionConfTypeDef *pHistogramRegionConfig)
{
  uint32_t tmp;

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    tmp = READ_REG(hdcmipp->Instance->P1CHSCR);
    pHistogramRegionConfig->HDec = (uint16_t)((tmp & DCMIPP_P1CHSCR_HDEC) >> DCMIPP_P1CHSCR_HDEC_Pos);
    pHistogramRegionConfig->VDec = (uint16_t)((tmp & DCMIPP_P1CHSCR_VDEC) >> DCMIPP_P1CHSCR_VDEC_Pos);
    pHistogramRegionConfig->VReg = (uint16_t)((tmp & DCMIPP_P1CHSCR_VREG) >> DCMIPP_P1CHSCR_VREG_Pos);
    pHistogramRegionConfig->HReg = (uint16_t)((tmp & DCMIPP_P1CHSCR_HREG) >> DCMIPP_P1CHSCR_HREG_Pos);

    tmp = READ_REG(hdcmipp->Instance->P1CHSSTR);
    pHistogramRegionConfig->VStart  = (uint16_t)((tmp & DCMIPP_P1CHSSTR_VSTART) >> DCMIPP_P1CHSSTR_VSTART_Pos);
    pHistogramRegionConfig->HStart  = (uint16_t)((tmp & DCMIPP_P1CHSSTR_HSTART) >> DCMIPP_P1CHSSTR_HSTART_Pos);

    tmp = READ_REG(hdcmipp->Instance->P1CHSSZR);
    pHistogramRegionConfig->VSize = (uint16_t)((tmp & DCMIPP_P1CHSSZR_VSIZE) >> DCMIPP_P1CHSSZR_VSIZE_Pos);
    pHistogramRegionConfig->HSize = (uint16_t)((tmp & DCMIPP_P1CHSSZR_HSIZE) >> DCMIPP_P1CHSSZR_HSIZE_Pos);

    pHistogramRegionConfig->MemoryAddress =  READ_REG(hdcmipp->Instance->P1CHSMAR1);
  }
}

/**
  * @brief  Return address of last stored Histogram
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pAddress address of last stored Histogram.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPHistoLastAddress(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                            uint32_t *pAddress)
{
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Check handle validity */
  if ((hdcmipp == NULL) || (pAddress == NULL))
  {
    return;
  }

  if (Pipe == DCMIPP_PIPE1)
  {
    *pAddress =  hdcmipp->Instance->P1HSSMAR;
  }
}
/**
  * @}
  */
#endif /* DCMIPP_P1HISTOGRAM_SUPPORT */
/**
  * @}
  */
/** @defgroup DCMIPP_Line_Event_Functions DCMIPP Line Event Functions
@verbatim
===============================================================================
            ##### Line Event Functions #####
===============================================================================
   [..]  This subsection provides a set of functions allowing to configure Line Event
   (+) HAL_DCMIPP_PIPE_EnableLineEvent  : Enable Line event.
   (+) HAL_DCMIPP_PIPE_DisableLineEvent : Disable Line event
@endverbatim
  * @{
  */
/**
  * @brief  Configures the position of the line interrupt.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  Line     Line Interrupt Position.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_EnableLineEvent(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe, uint32_t Line)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_PIPE_MULTILINE(Line));

  if (Pipe == DCMIPP_PIPE0)
  {
    /* Set MultiLine configuration */
    MODIFY_REG(hdcmipp->Instance->P0PPCR, DCMIPP_P0PPCR_LINEMULT, Line);

    /* Enable Multiline Interrupt */
    __HAL_DCMIPP_ENABLE_IT(hdcmipp, DCMIPP_IT_PIPE0_LINE);
  }
  else if (Pipe == DCMIPP_PIPE1)
  {
    /* Set MultiLine configuration */
    MODIFY_REG(hdcmipp->Instance->P1PPCR, DCMIPP_P1PPCR_LINEMULT, Line);

    /* Enable Multiline Interrupt */
    __HAL_DCMIPP_ENABLE_IT(hdcmipp, DCMIPP_IT_PIPE1_LINE);
  }
  else if (Pipe == DCMIPP_PIPE2)
  {
    /* Set MultiLine configuration */
    MODIFY_REG(hdcmipp->Instance->P2PPCR, DCMIPP_P2PPCR_LINEMULT, Line);

    /* Enable Multiline Interrupt */
    __HAL_DCMIPP_ENABLE_IT(hdcmipp, DCMIPP_IT_PIPE2_LINE);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Disable the the line event interrupt.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_DisableLineEvent(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Disable Multiline Interrupt */
  if (Pipe == DCMIPP_PIPE0)
  {
    __HAL_DCMIPP_DISABLE_IT(hdcmipp, DCMIPP_IT_PIPE0_LINE);
  }
  else if (Pipe == DCMIPP_PIPE1)
  {
    __HAL_DCMIPP_DISABLE_IT(hdcmipp, DCMIPP_IT_PIPE1_LINE);
  }
  else if (Pipe == DCMIPP_PIPE2)
  {
    __HAL_DCMIPP_DISABLE_IT(hdcmipp, DCMIPP_IT_PIPE2_LINE);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @}
  */
#if defined(DCMIPP_CSI2_SUPPORT)
/** @defgroup DCMIPP_PeripheralControl_Functions DCMIPP Peripheral Control Functions
  * @{
  */
/**
  * @brief  Enable Share between DCMIPP_PIPE1 and DCMIPP_PIPE2
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_CSI_EnableShare(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE2)
  {
    /* Pipe2 receives the same data as Pipe1 */
    CLEAR_BIT(hdcmipp->Instance->P1FSCR, DCMIPP_P1FSCR_PIPEDIFF);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Disable Share between DCMIPP_PIPE1 and DCMIPP_PIPE2
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_CSI_DisableShare(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE2)
  {
    /* Differentiates Pipe2 from pipe1 */
    SET_BIT(hdcmipp->Instance->P1FSCR, DCMIPP_P1FSCR_PIPEDIFF);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Force Data Type Format for the selected Pipe
  * @param  hdcmipp         Pointer to DCMIPP handle
  * @param  Pipe            Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  DataTypeFormat  Specifies the Data Type Format, can be a value from @ref DCMIPP_DataType
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_CSI_ForceDataTypeFormat(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                          uint32_t DataTypeFormat)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_DATA_TYPE(DataTypeFormat));

  if (Pipe == DCMIPP_PIPE1)
  {
    /* Force data type format */
    MODIFY_REG(hdcmipp->Instance->P1FSCR, DCMIPP_P1FSCR_FDTF,  DataTypeFormat << DCMIPP_P1FSCR_FDTF_Pos);

    /* Force data type format enable */
    SET_BIT(hdcmipp->Instance->P1FSCR, DCMIPP_P1FSCR_FDTFEN);
  }
  else if (Pipe == DCMIPP_PIPE2)
  {
    /* Check that PIPEDIFF is enabled */
    if ((hdcmipp->Instance->P2FSCR & DCMIPP_P1FSCR_PIPEDIFF) == DCMIPP_P1FSCR_PIPEDIFF)
    {
      /* Force data type format */
      MODIFY_REG(hdcmipp->Instance->P2FSCR, DCMIPP_P1FSCR_FDTF,  DataTypeFormat << DCMIPP_P1FSCR_FDTF_Pos);

      /* Force data type format enable */
      SET_BIT(hdcmipp->Instance->P2FSCR, DCMIPP_P1FSCR_FDTFEN);
    }
    else
    {
      return HAL_ERROR;
    }
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Reconfigure the Data Type Mode
  * @param  hdcmipp       Pointer to DCMIPP handle
  * @param  Pipe          Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  DataTypeMode  Specifies the Data Type Mode, can be a value from @ref DCMIPP_DataTypeMode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_CSI_SetDTMode(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe, uint32_t DataTypeMode)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_DATA_TYPE_MODE(DataTypeMode));

  if (Pipe == DCMIPP_PIPE0)
  {
    MODIFY_REG(hdcmipp->Instance->P0FSCR, DCMIPP_P0FSCR_DTMODE,  DataTypeMode << DCMIPP_P0FSCR_DTMODE_Pos);
  }
  else if (Pipe == DCMIPP_PIPE1)
  {
    MODIFY_REG(hdcmipp->Instance->P1FSCR, DCMIPP_P1FSCR_DTMODE,  DataTypeMode << DCMIPP_P1FSCR_DTMODE_Pos);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Reconfigure the Data Type Selection
  * @param  hdcmipp     Pointer to DCMIPP handle
  * @param  Pipe        Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  DataTypeID  Specifies the Data Type ID, can be a value from @ref DCMIPP_DataTypeSelection
  * @param  DataType    Specifies the Data Type Format, can be a value from @ref DCMIPP_DataType
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_CSI_SetDTSelection(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe, uint32_t DataTypeID,
                                                     uint32_t DataType)
{
  uint32_t pxfscr_dtid_Msk;

  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_DATA_TYPE(DataType));

  if (DataTypeID == DCMIPP_DTSELECT_IDA)
  {
    pxfscr_dtid_Msk = DCMIPP_P0FSCR_DTIDA_Msk;
  }
  else /* DATA_TYPE_SELECTION_IDB */
  {
    pxfscr_dtid_Msk = DCMIPP_P0FSCR_DTIDB_Pos;
  }

  if (Pipe == DCMIPP_PIPE0)
  {
    MODIFY_REG(hdcmipp->Instance->P0FSCR, pxfscr_dtid_Msk,  DataType << DataTypeID);
  }
  else if (Pipe == DCMIPP_PIPE1)
  {
    MODIFY_REG(hdcmipp->Instance->P1FSCR, pxfscr_dtid_Msk,  DataType << DataTypeID);
  }
  else if (Pipe == DCMIPP_PIPE2)
  {
    if (DataTypeID == DCMIPP_DTSELECT_IDA)
    {
      MODIFY_REG(hdcmipp->Instance->P2FSCR, pxfscr_dtid_Msk,  DataType << DataTypeID);
    }
    else
    {
      return HAL_ERROR;
    }
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Enable CSI Header dump for the selected DCMIPP Pipe
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_CSI_EnableHeader(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE0)
  {
    SET_BIT(hdcmipp->Instance->P0PPCR, DCMIPP_P0PPCR_HEADEREN);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Disable CSI Header dump for the selected DCMIPP Pipe
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_CSI_DisableHeader(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE0)
  {
    CLEAR_BIT(hdcmipp->Instance->P0PPCR, DCMIPP_P0PPCR_HEADEREN);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Set Virtual ChannelID of the pipe
  * @param  hdcmipp              Pointer to DCMIPP handle
  * @param  Pipe                 Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  VirtualChannelID     Virtual channel ID
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_DCMIPP_PIPE_CSI_SetVirtualChannelID(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                           uint32_t VirtualChannelID)
{
  if (Pipe == DCMIPP_PIPE0)
  {
    /* Virtual channel ID of the CSI flow for pipe0 */
    MODIFY_REG(hdcmipp->Instance->P0FSCR, DCMIPP_P0FSCR_VC, VirtualChannelID << DCMIPP_P0FSCR_VC_Pos);
  }
  else if (Pipe == DCMIPP_PIPE1)
  {
    /* Virtual channel ID of the CSI flow for pipe1 */
    MODIFY_REG(hdcmipp->Instance->P1FSCR, DCMIPP_P1FSCR_VC, VirtualChannelID << DCMIPP_P1FSCR_VC_Pos);
  }
  else if (Pipe == DCMIPP_PIPE2)
  {
    /* Virtual channel ID of the CSI flow for pipe2 */
    MODIFY_REG(hdcmipp->Instance->P2FSCR, DCMIPP_P2FSCR_VC, VirtualChannelID << DCMIPP_P2FSCR_VC_Pos);
  }
  else
  {
    return HAL_ERROR;
  }
  return HAL_OK;
}
/**
  * @}
  */
#endif /* DCMIPP_CSI2_SUPPORT */
/** @defgroup DCMIPP_Frame_Counter_Functions DCMIPP Frame Counter Functions
@verbatim
===============================================================================
            ##### Frame Counter Functions #####
===============================================================================
    [..]  This subsection provides a set of functions allowing
    (+) HAL_DCMIPP_PIPE_SetFrameCounterConfig : Set Frame counter configuration
    (+) HAL_DCMIPP_PIPE_ResetFrameCounter     : Reset Frame Counter
    (+) HAL_DCMIPP_PIPE_ReadFrameCounter      : Read Frame Counter
@endverbatim
  * @{
  */
/**
  * @brief  Associate the frame counter to the selected DCMIPP pipe.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_SetFrameCounterConfig(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Check pointer validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Check the DCMIPP State */
  if (hdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    /* Configure Pipe Selection for the frame counter */
    MODIFY_REG(hdcmipp->Instance->CMCR, DCMIPP_CMCR_PSFC, Pipe << DCMIPP_CMCR_PSFC_Pos);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Reset the DCMIPP Pipe frame counter
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_ResetFrameCounter(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{

  /* Check pointer validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Check the DCMIPP State */
  if (hdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    /* Clear Frame counter */
    SET_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_CFC);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Read the DCMIPP frame counter
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pCounter pointer to store the value of the frame counter
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_ReadFrameCounter(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                   uint32_t *pCounter)
{

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Check pointer validity */
  if ((hdcmipp == NULL) || (pCounter == NULL))
  {
    return HAL_ERROR;
  }

  /* Check the DCMIPP State */
  if (hdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    /* Read frame counter */
    *pCounter = READ_REG(hdcmipp->Instance->CMFRCR);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @}
  */

/** @defgroup DCMIPP_Data_Counter_Functions DCMIPP Data Counter Functions
  * @{
  */
/**
  * @brief  Read Number of data dumped during the frame.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pCounter pointer to amount of word transferred
  * @note   Data Counter is available only on DCMIPP_PIPE0. The counter saturates at 0x3FFFFFF.
  * @note   Granularity is 32-bit for all the formats except for the
  *         byte stream formats (e.g. JPEG) having byte granularity
  * @retval Status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_GetDataCounter(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                 uint32_t *pCounter)
{
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  /* Check pointer validity */
  if ((hdcmipp == NULL) || (pCounter == NULL))
  {
    return HAL_ERROR;
  }

  /* Check the DCMIPP State */
  if (hdcmipp->State == HAL_DCMIPP_STATE_READY)
  {
    /* Read  Pipe0 dump counter register */
    *pCounter = READ_REG(hdcmipp->Instance->P0DCCNTR);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}
/**
  * @brief  Get the Statistic accumulated value for the selected module
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  ModuleID Specifies the Module ID, can be a value from @ref DCMIPP_Statistics_Extraction_Module_ID.
  * @param  pCounter pointer to receive the accumulated value
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_PIPE_GetISPAccumulatedStatisticsCounter(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                                     uint8_t ModuleID, uint32_t *pCounter)
{

  /* Check handle validity */
  if ((hdcmipp == NULL) || (pCounter == NULL))
  {
    return HAL_ERROR;
  }

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));
  assert_param(IS_DCMIPP_STAT_EXTRACTION_MODULE(ModuleID));

  if (Pipe == DCMIPP_PIPE1)
  {
    switch (ModuleID)
    {
      case DCMIPP_STATEXT_MODULE1:
        *pCounter = (READ_REG(hdcmipp->Instance->P1ST1SR & DCMIPP_P1ST1SR_ACCU));
        break;
      case DCMIPP_STATEXT_MODULE2:
        *pCounter = (READ_REG(hdcmipp->Instance->P1ST2SR & DCMIPP_P1ST2SR_ACCU));
        break;
      case DCMIPP_STATEXT_MODULE3:
        *pCounter = (READ_REG(hdcmipp->Instance->P1ST3SR & DCMIPP_P1ST3SR_ACCU));
        break;
      default:
        break;
    }
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

