zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dcmipp.c
#if defined(DCMIPP_CSI2_SUPPORT)
/**
  * @brief  Get the current operating mode of the DCMIPP
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @retval Returns  the current operating mode of the DCMIPP can be a value from @ref DCMIPP_modes.
  */
uint32_t HAL_DCMIPP_GetMode(const DCMIPP_HandleTypeDef *hdcmipp)
{
  /* Check parameters */
  assert_param(IS_DCMIPP_ALL_INSTANCE(hdcmipp->Instance));

  /* Read the configured Mode */
  return READ_BIT(hdcmipp->Instance->CMCR, DCMIPP_CMCR_INSEL) ;
}
#endif /* DCMIPP_CSI2_SUPPORT */
/**
  * @}
  */
/** @defgroup DCMIPP_Exported_Functions_Group6 DCMIPP Get Config functions
@verbatim
===============================================================================
            ##### Get Config Functions #####
===============================================================================
  [..]  This subsection provides a set of functions allowing to Get the configuration.
@endverbatim
  * @{
  */
/**
  * @brief  Retrieve the ISP decimation configuration for a specified DCMIPP pipe.
  * @param  hdcmipp      Pointer to DCMIPP handle
  * @param  Pipe         Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pDecConfig   Pointer to a DCMIPP_DecimationConfTypeDef structure that will be
  *                      filled with the decimation configuration of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPDecimationConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                            DCMIPP_DecimationConfTypeDef *pDecConfig)
{
  uint32_t p1decr;
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    p1decr = READ_REG(hdcmipp->Instance->P1DECR);
    pDecConfig->HRatio = (p1decr & DCMIPP_P1DECR_HDEC);
    pDecConfig->VRatio = (p1decr & DCMIPP_P1DECR_VDEC);
  }
}

/**
  * @brief  Retrieve the ISP control statistic extraction configuration for a specified DCMIPP pipe and module.
  * @param  hdcmipp                             Pointer to DCMIPP handle
  * @param  Pipe                                Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  ModuleID                            Specifies the Module ID, can be a value from
  *                                             DCMIPP_Statistics_Extraction_Module_ID.
  * @param  pStatisticExtractionConfig          Pointer to a DCMIPP_StatisticExtractionConfTypeDef structure
  *                                             that will be filled with the statistic extraction configuration
  *                                             of the specified module.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPStatisticExtractionConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                     uint8_t ModuleID,
                                                     DCMIPP_StatisticExtractionConfTypeDef
                                                     *pStatisticExtractionConfig)
{
  uint32_t tmp;
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    switch (ModuleID)
    {
      case DCMIPP_STATEXT_MODULE1:
        tmp = READ_REG(hdcmipp->Instance->P1ST1CR);
        break;
      case DCMIPP_STATEXT_MODULE2:
        tmp = READ_REG(hdcmipp->Instance->P1ST2CR);
        break;
      default:
        /* DCMIPP_STATEXT_MODULE3 */
        tmp = READ_REG(hdcmipp->Instance->P1ST3CR);
        break;
    }

    pStatisticExtractionConfig->Bins   = ((tmp & DCMIPP_P1ST1CR_BINS));
    pStatisticExtractionConfig->Mode   = ((tmp & DCMIPP_P1ST1CR_MODE));
    pStatisticExtractionConfig->Source = ((tmp & DCMIPP_P1ST1CR_SRC));
  }
}
/**
  * @brief  Retrieve the ISP area statistic extraction configuration for a specified DCMIPP pipe.
  * @param  hdcmipp                          Pointer to DCMIPP handle
  * @param  Pipe                             Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes.
  * @param  pStatisticExtractionAreaConfig   Pointer to a DCMIPP_StatisticExtractionAreaConfTypeDef structure
  *                                          that will be filled with the area statistic extraction configuration
  *                                          of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPAreaStatisticExtractionConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                         DCMIPP_StatisticExtractionAreaConfTypeDef
                                                         *pStatisticExtractionAreaConfig)
{
  uint32_t tmp;
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    tmp = READ_REG(hdcmipp->Instance->P1STSTR);
    pStatisticExtractionAreaConfig->HStart = ((tmp & DCMIPP_P1STSTR_HSTART) >> DCMIPP_P1STSTR_HSTART_Pos);
    pStatisticExtractionAreaConfig->VStart = ((tmp & DCMIPP_P1STSTR_VSTART) >> DCMIPP_P1STSTR_VSTART_Pos);

    tmp = READ_REG(hdcmipp->Instance->P1STSZR);
    pStatisticExtractionAreaConfig->VSize  = ((tmp & DCMIPP_P1STSZR_VSIZE) >> DCMIPP_P1STSZR_VSIZE_Pos);
    pStatisticExtractionAreaConfig->HSize  = ((tmp & DCMIPP_P1STSZR_HSIZE) >> DCMIPP_P1STSZR_HSIZE_Pos);
  }
}
/**
  * @brief  Retrieve the ISP control contrast configuration for a specified DCMIPP pipe.
  * @param  hdcmipp          Pointer to DCMIPP handle
  * @param  Pipe             Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pContrastConfig  Pointer to a DCMIPP_ContrastConfTypeDef structure that will be
  *                          filled with the contrast configuration of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPCtrlContrastConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                              DCMIPP_ContrastConfTypeDef *pContrastConfig)
{
  uint32_t tmp;

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    tmp = READ_REG(hdcmipp->Instance->P1CTCR1);

    pContrastConfig->LUM_0    = (uint8_t)((tmp & DCMIPP_P1CTCR1_LUM0) >> DCMIPP_P1CTCR1_LUM0_Pos);

    tmp = READ_REG(hdcmipp->Instance->P1CTCR2);
    pContrastConfig->LUM_32   = (uint8_t)((tmp & DCMIPP_P1CTCR2_LUM1) >> DCMIPP_P1CTCR2_LUM1_Pos);
    pContrastConfig->LUM_64   = (uint8_t)((tmp & DCMIPP_P1CTCR2_LUM2) >> DCMIPP_P1CTCR2_LUM2_Pos);
    pContrastConfig->LUM_96   = (uint8_t)((tmp & DCMIPP_P1CTCR2_LUM3) >> DCMIPP_P1CTCR2_LUM3_Pos);
    pContrastConfig->LUM_128  = (uint8_t)((tmp & DCMIPP_P1CTCR2_LUM4) >> DCMIPP_P1CTCR2_LUM4_Pos);

    tmp = READ_REG(hdcmipp->Instance->P1CTCR3);
    pContrastConfig->LUM_160  = (uint8_t)((tmp & DCMIPP_P1CTCR3_LUM5) >> DCMIPP_P1CTCR3_LUM5_Pos);
    pContrastConfig->LUM_192  = (uint8_t)((tmp & DCMIPP_P1CTCR3_LUM6) >> DCMIPP_P1CTCR3_LUM6_Pos);
    pContrastConfig->LUM_224  = (uint8_t)((tmp & DCMIPP_P1CTCR3_LUM7) >> DCMIPP_P1CTCR3_LUM7_Pos);
    pContrastConfig->LUM_256  = (uint8_t)((tmp & DCMIPP_P1CTCR3_LUM8) >> DCMIPP_P1CTCR3_LUM8_Pos);
  }
}
/**
  * @brief  Retrieve the ISP exposure configuration for a specified DCMIPP pipe.
  * @param  hdcmipp         Pointer to DCMIPP handle
  * @param  Pipe            Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pExposureConfig Pointer to a DCMIPP_ExposureConfTypeDef structure that will be
  *                         filled with the exposure configuration of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPExposureConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                          DCMIPP_ExposureConfTypeDef *pExposureConfig)
{
  uint32_t tmp;

  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    tmp = READ_REG(hdcmipp->Instance->P1EXCR2);

    pExposureConfig->MultiplierBlue  = (uint8_t)((tmp & DCMIPP_P1EXCR2_MULTB) >> DCMIPP_P1EXCR2_MULTB_Pos);
    pExposureConfig->ShiftBlue       = (uint8_t)((tmp & DCMIPP_P1EXCR2_SHFB) >> DCMIPP_P1EXCR2_SHFB_Pos);
    pExposureConfig->ShiftGreen      = (uint8_t)((tmp & DCMIPP_P1EXCR2_SHFG) >> DCMIPP_P1EXCR2_SHFG_Pos);
    pExposureConfig->MultiplierGreen = (uint8_t)((tmp & DCMIPP_P1EXCR2_MULTG) >> DCMIPP_P1EXCR2_MULTG_Pos);

    tmp = READ_REG(hdcmipp->Instance->P1EXCR1);

    pExposureConfig->MultiplierRed   = (uint8_t)((tmp & DCMIPP_P1EXCR1_MULTR) >> DCMIPP_P1EXCR1_MULTR_Pos);
    pExposureConfig->ShiftRed        = (uint8_t)((tmp & DCMIPP_P1EXCR1_SHFR) >> DCMIPP_P1EXCR1_SHFR_Pos);
  }
}
/**
  * @brief  Retrieve the ISP Raw Bayer to RGB conversion configuration for a specified DCMIPP pipe.
  * @param  hdcmipp             Pointer to DCMIPP handle
  * @param  Pipe                Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pRawBayer2RGBConfig Pointer to a DCMIPP_RawBayer2RGBConfTypeDef structure that will be
  *                             filled with the Raw Bayer to RGB conversion configuration of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPRawBayer2RGBConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                              DCMIPP_RawBayer2RGBConfTypeDef *pRawBayer2RGBConfig)
{
  uint32_t p1dmcr_reg;
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    p1dmcr_reg = READ_REG(hdcmipp->Instance->P1DMCR);

    pRawBayer2RGBConfig->EdgeStrength  = ((p1dmcr_reg & DCMIPP_P1DMCR_EDGE) >> DCMIPP_P1DMCR_EDGE_Pos);
    pRawBayer2RGBConfig->HLineStrength = ((p1dmcr_reg & DCMIPP_P1DMCR_LINEH) >> DCMIPP_P1DMCR_LINEH_Pos);
    pRawBayer2RGBConfig->PeakStrength  = ((p1dmcr_reg & DCMIPP_P1DMCR_PEAK) >> DCMIPP_P1DMCR_PEAK_Pos);
    pRawBayer2RGBConfig->RawBayerType  = (p1dmcr_reg & DCMIPP_P1DMCR_TYPE);
    pRawBayer2RGBConfig->VLineStrength = ((p1dmcr_reg & DCMIPP_P1DMCR_LINEV) >> DCMIPP_P1DMCR_LINEV_Pos);
  }
}
/**
  * @brief  Retrieve the ISP color conversion configuration for a specified DCMIPP pipe.
  * @param  hdcmipp                 Pointer to DCMIPP handle
  * @param  Pipe                    Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pColorConversionConfig  Pointer to a DCMIPP_ColorConversionConfTypeDef structure that will be
  *                                 filled with the color conversion configuration of the specified pipe.
  * @retval None
  */
void HAL_DCMIPP_PIPE_GetISPColorConversionConfig(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe,
                                                 DCMIPP_ColorConversionConfTypeDef *pColorConversionConfig)
{
  uint16_t tmp;
  /* Check parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  if (Pipe == DCMIPP_PIPE1)
  {
    tmp = (uint16_t)READ_REG(hdcmipp->Instance->P1CCCR);

    UNUSED(tmp);

