zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dcmipp.c
  }
  else
  {
    /* State Disabled */
    return 0;
  }
}
/**
  * @}
  */
#if defined(DCMIPP_CSI2_SUPPORT)
/** @defgroup DCMIPP_PeripheralControl_Functions DCMIPP Peripheral Control Functions
  * @{
  */
/**
  * @brief  Configure the DCMIPP CSI Line/Byte Counter for the selected counter according to the user parameters.
  * @param  hdcmipp         Pointer to DCMIPP handle
  * @param  Counter         Specifies the counter, can be a value from @ref DCMIPP_CSI_Counter
  * @param  pLineByteConfig Pointer to DCMIPP_CSI_LineByteCounterConfTypeDef that contains the Line/Byte Counter
  *                         configuration information for CSI.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_SetLineByteCounterConfig(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Counter,
                                                          const DCMIPP_CSI_LineByteCounterConfTypeDef *pLineByteConfig)
{
  CSI_TypeDef *csi_instance;
  csi_instance = CSI;
  uint32_t prgitr_lbxvc_msk = ((uint32_t)CSI_PRGITR_LB0VC << (Counter * 4U));
  uint32_t prgitr_lbxvc_pos = CSI_PRGITR_LB0VC_Pos + (Counter * 4U);

  /* Check pointer validity */
  if ((hdcmipp == NULL) || (pLineByteConfig == NULL))
  {
    return HAL_ERROR;
  }

  assert_param(IS_DCMIPP_ALL_INSTANCE(hdcmipp->Instance));
  assert_param(IS_DCMIPP_CSI_COUNTER(Counter));
  assert_param(IS_DCMIPP_CSI_LINE_COUNTER(pLineByteConfig->LineCounter));
  assert_param(IS_DCMIPP_CSI_BYTE_COUNTER(pLineByteConfig->ByteCounter));
  assert_param(IS_DCMIPP_VCID(pLineByteConfig->VirtualChannel));

  switch (Counter)
  {
    case DCMIPP_CSI_COUNTER0:
      WRITE_REG(csi_instance->LB0CFGR, (pLineByteConfig->LineCounter << CSI_LB0CFGR_LINECNT_Pos) | \
                pLineByteConfig->ByteCounter);
      break;
    case DCMIPP_CSI_COUNTER1:
      WRITE_REG(csi_instance->LB1CFGR, (pLineByteConfig->LineCounter << CSI_LB1CFGR_LINECNT_Pos) | \
                pLineByteConfig->ByteCounter);
      break;
    case DCMIPP_CSI_COUNTER2:
      WRITE_REG(csi_instance->LB2CFGR, (pLineByteConfig->LineCounter << CSI_LB2CFGR_LINECNT_Pos) | \
                pLineByteConfig->ByteCounter);
      break;
    case DCMIPP_CSI_COUNTER3:
      WRITE_REG(csi_instance->LB3CFGR, (pLineByteConfig->LineCounter << CSI_LB3CFGR_LINECNT_Pos) | \
                pLineByteConfig->ByteCounter);
      break;
    default:
      break;
  }

  /* Link the Line/Byte Counter to the selected virtual channel */
  MODIFY_REG(csi_instance->PRGITR, prgitr_lbxvc_msk, pLineByteConfig->VirtualChannel << prgitr_lbxvc_pos);

  return HAL_OK;
}
/**
  * @brief  Enable the selected DCMIPP CSI Line/Byte Counter.
  * @param  hdcmipp         Pointer to DCMIPP handle
  * @param  Counter         Specifies the counter, can be a value from @ref DCMIPP_CSI_Counter
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_EnableLineByteCounter(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Counter)
{
  CSI_TypeDef *csi_instance;
  csi_instance = CSI;

  assert_param(IS_DCMIPP_CSI_COUNTER(Counter));

  /* Check pointer validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Enable the Line/Byte Counter IT */
  __HAL_DCMIPP_CSI_ENABLE_IT(csi_instance, ((uint32_t)DCMIPP_CSI_IT_LB0 << Counter));

  /* Enable the selected counter */
  SET_BIT(csi_instance->PRGITR, ((uint32_t)CSI_PRGITR_LB0EN << (Counter * 4U)));

  return HAL_OK;
}
/**
  * @brief  Disable the selected DCMIPP CSI Line/Byte Counter.
  * @param  hdcmipp         Pointer to DCMIPP handle
  * @param  Counter         Specifies the counter, can be a value from @ref DCMIPP_CSI_Counter
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_DisableLineByteCounter(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Counter)
{
  CSI_TypeDef *csi_instance;
  csi_instance = CSI;

  assert_param(IS_DCMIPP_CSI_COUNTER(Counter));

  /* Check pointer validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Disable the Line/Byte Counter IT */
  __HAL_DCMIPP_CSI_DISABLE_IT(csi_instance, DCMIPP_CSI_IT_LB0 << Counter);

  /* Disable the selected counter */
  CLEAR_BIT(csi_instance->PRGITR, CSI_PRGITR_LB0EN << (Counter * 4U));

  return HAL_OK;
}
/**
  * @brief  Configure the DCMIPP CSI Timer for the selected timer according to the user parameters.
  * @param  hdcmipp     Pointer to DCMIPP handle
  * @param  Timer       Specifies the Timer, can be a value from @ref DCMIPP_CSI_Timer
  * @param  TimerConfig Pointer to DCMIPP_CSI_TimerConfTypeDef that contains the timer
  *                     configuration information for CSI.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_SetTimerConfig(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Timer,
                                                const DCMIPP_CSI_TimerConfTypeDef *TimerConfig)
{
  CSI_TypeDef *csi_instance;
  csi_instance = CSI;

  uint32_t prgitr_lbx_index = CSI_PRGITR_TIM0VC_Pos + (Timer * 4U);
  uint32_t prgitr_lbxvc_msk = ((uint32_t)CSI_PRGITR_TIM0VC << (Timer * 4U));
  uint32_t startpoint_pos = CSI_PRGITR_TIM0EOF_Pos + (Timer * 4U);

  /* Check pointer validity */
  if ((hdcmipp == NULL) || (TimerConfig == NULL))
  {
    return HAL_ERROR;
  }

  assert_param(IS_DCMIPP_VCID(TimerConfig->VirtualChannel));
  assert_param(IS_DCMIPP_CSI_TIMER(Timer));
  assert_param(IS_DCMIPP_CSI_TIMER_START(TimerConfig->StartPoint));

  /* Set counter value and the start point for the selected timer */
  switch (Timer)
  {
    case DCMIPP_CSI_TIMER0:
      WRITE_REG(csi_instance->TIM0CFGR, TimerConfig->Count);
      break;
    case DCMIPP_CSI_TIMER1:
      WRITE_REG(csi_instance->TIM1CFGR, TimerConfig->Count);
      break;
    case DCMIPP_CSI_TIMER2:
      WRITE_REG(csi_instance->TIM2CFGR, TimerConfig->Count);
      break;
    case DCMIPP_CSI_TIMER3:
      WRITE_REG(csi_instance->TIM3CFGR, TimerConfig->Count);
      break;
    default:
      break;
  }

  SET_BIT(csi_instance->PRGITR, TimerConfig->StartPoint << startpoint_pos);

  /* Link the timer to the selected virtual channel */
  MODIFY_REG(csi_instance->PRGITR, prgitr_lbxvc_msk, (TimerConfig->VirtualChannel) << prgitr_lbx_index);

  return HAL_OK;

