zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/src/stm32mp2xx_hal_dcmipp.c
}
/**
  * @brief  Enable the selected DCMIPP CSI Timer.
  * @param  hdcmipp     Pointer to DCMIPP handle
  * @param  Timer       Specifies the Timer, can be a value from @ref DCMIPP_CSI_Timer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_EnableTimer(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Timer)
{
  CSI_TypeDef *csi_instance;
  csi_instance = CSI;

  assert_param(IS_DCMIPP_CSI_TIMER(Timer));

  /* Check pointer validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Enable the Timer x IT */
  __HAL_DCMIPP_CSI_ENABLE_IT(csi_instance, ((uint32_t)DCMIPP_CSI_IT_TIM0 << Timer));

  /* Enable the selected timer */
  SET_BIT(csi_instance->PRGITR, ((uint32_t)CSI_PRGITR_TIM0EN << (Timer * 4U)));

  return HAL_OK;
}
/**
  * @brief  Disable the selected DCMIPP CSI Timer.
  * @param  hdcmipp     Pointer to DCMIPP handle
  * @param  Timer       Specifies the Timer, can be a value from @ref DCMIPP_CSI_Timer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_DisableTimer(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Timer)
{
  CSI_TypeDef *csi_instance;
  csi_instance = CSI;

  assert_param(IS_DCMIPP_CSI_TIMER(Timer));

  /* Check pointer validity */
  if (hdcmipp == NULL)
  {
    return HAL_ERROR;
  }

  /* Disable the Line/Byte Counter IT */
  __HAL_DCMIPP_CSI_DISABLE_IT(csi_instance, DCMIPP_CSI_IT_TIM0 << Timer);

  /* Disable the selected counter */
  CLEAR_BIT(csi_instance->PRGITR, CSI_PRGITR_TIM0EN << (Timer * 4U));

  return HAL_OK;
}
/**
  * @brief  Configure the DCMIPP CSI Watchdog counter.
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Counter  Specifies the watchdog counter value
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DCMIPP_CSI_SetWatchdogCounterConfig(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Counter)
{
  UNUSED(hdcmipp);
  CSI_TypeDef *csi_instance;
  csi_instance = CSI;

  /* Configure the watchdog counter */
  WRITE_REG(csi_instance->WDR, Counter);

  /* Enable the watchdog IT */
  __HAL_DCMIPP_CSI_ENABLE_IT(csi_instance, DCMIPP_CSI_IT_WDERR);

  return HAL_OK;
}
#endif /* DCMIPP_CSI2_SUPPORT */

/**
  * @}
  */

/** @defgroup DCMIPP_State_and_Error_Functions DCMIPP State and Error Functions
@verbatim
===============================================================================
            ##### State and Error Functions #####
===============================================================================
    [..]  This subsection provides a set of functions allowing
    (+) HAL_DCMIPP_GetState      : Get DCMIPP State.
    (+) HAL_DCMIPP_PIPE_GetState : Get PIPE State.
    (+) HAL_DCMIPP_GetError      : Get DCMIPP Error.
@endverbatim
  * @{
  */

/**
  * @brief  Return the DCMIPP state
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @retval HAL state
  */
HAL_DCMIPP_StateTypeDef HAL_DCMIPP_GetState(const DCMIPP_HandleTypeDef *hdcmipp)
{
  return hdcmipp->State;
}
/**
  * @brief  Return the DCMIPP error code
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @retval DCMIPP Error Code
  */
uint32_t HAL_DCMIPP_GetError(const DCMIPP_HandleTypeDef *hdcmipp)
{
  return hdcmipp->ErrorCode;
}
/**
  * @brief  Return the DCMIPP state
  * @param  hdcmipp  Pointer to DCMIPP handle
  * @param  Pipe     Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @retval HAL state
  */
HAL_DCMIPP_PipeStateTypeDef HAL_DCMIPP_PIPE_GetState(const DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  /* Check Parameters */
  assert_param(IS_DCMIPP_PIPE(Pipe));

  return hdcmipp->PipeState[Pipe];
}

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup DCMIPP_Private_Functions DCMIPP Private Functions
  * @{
  */
/**
  * @brief  Configure the selected Pipe
  * @param  hdcmipp     Pointer to DCMIPP handle
  * @param  Pipe        Specifies the DCMIPP pipe, can be a value from @ref DCMIPP_Pipes
  * @param  pPipeConfig pointer to the DCMIPP_PipeConfTypeDef structure that contains
  *                     the configuration information for the pipe.
  * @retval None
  */
static void Pipe_Config(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe, const DCMIPP_PipeConfTypeDef *pPipeConfig)
{
  if (Pipe == DCMIPP_PIPE0)
  {
    /* Configure Pipe0 */
    /* Configure Frame Rate */
    MODIFY_REG(hdcmipp->Instance->P0FCTCR, DCMIPP_P0FCTCR_FRATE, pPipeConfig->FrameRate);
  }
  else if (Pipe == DCMIPP_PIPE1)
  {
    /* Configure Pipe1 */
    /* Configure Frame Rate */
    MODIFY_REG(hdcmipp->Instance->P1FCTCR, DCMIPP_P1FCTCR_FRATE, pPipeConfig->FrameRate);

    /* Configure the pixel packer */
    MODIFY_REG(hdcmipp->Instance->P1PPCR, DCMIPP_P1PPCR_FORMAT, pPipeConfig->PixelPackerFormat);

    /* Configure Pixel Pipe Pitch */
    MODIFY_REG(hdcmipp->Instance->P1PPM0PR, DCMIPP_P1PPM0PR_PITCH,
               pPipeConfig->PixelPipePitch << DCMIPP_P1PPM0PR_PITCH_Pos);

    if ((pPipeConfig->PixelPackerFormat == DCMIPP_PIXEL_PACKER_FORMAT_YUV422_2) ||
        (pPipeConfig->PixelPackerFormat == DCMIPP_PIXEL_PACKER_FORMAT_YUV420_2))
    {
      /* Configure Pixel Pipe Pitch */
      MODIFY_REG(hdcmipp->Instance->P1PPM1PR, DCMIPP_P1PPM1PR_PITCH,
                 pPipeConfig->PixelPipePitch << DCMIPP_P1PPM1PR_PITCH_Pos);
    }
    else if (pPipeConfig->PixelPackerFormat == DCMIPP_PIXEL_PACKER_FORMAT_YUV420_3)
    {
      /* Configure Pixel Pipe Pitch */
      MODIFY_REG(hdcmipp->Instance->P1PPM1PR, DCMIPP_P1PPM1PR_PITCH,
                 ((pPipeConfig->PixelPipePitch) / 2U) << DCMIPP_P1PPM1PR_PITCH_Pos);
    }
    else
    {
      /* Do nothing */
    }
  }
  else
  {
    /* Configure Pipe2 */
    /* Configure Frame Rate */
    MODIFY_REG(hdcmipp->Instance->P2FCTCR, DCMIPP_P2FCTCR_FRATE, pPipeConfig->FrameRate);

    /* Configure the pixel packer */
    MODIFY_REG(hdcmipp->Instance->P2PPCR, DCMIPP_P2PPCR_FORMAT, pPipeConfig->PixelPackerFormat);

    /* Configure Pixel Pipe Pitch */
    MODIFY_REG(hdcmipp->Instance->P2PPM0PR, DCMIPP_P2PPM0PR_PITCH,
               pPipeConfig->PixelPipePitch << DCMIPP_P2PPM0PR_PITCH_Pos);
  }
}

